{
  "introduction": {
    "imageUrl": "course-frontend.jpg",
    "text": "A 4 month accelerated learning program, with focus on Frontend and particularly React. It consists of 7 individual projects with set requirements and increasing complexity. The students have daily lectures and mentor meetings. Software engineering practices are taken into consideration, so students can produce code with high value.",
    "title": "Frontend Course"
  },
  "moreInformation": {
    "slide_url": "http://novare-tech-education.web.app/files/fe-course.pdf"
  },
  "process": [
    {
      "description": "The students start with a brief similar to a real interview coding test. They analyze it by extracting and classifying the information.",
      "icon_name": "search",
      "icon_prefix": "fas",
      "id": 1,
      "name": "Requirement gathering"
    },
    {
      "description": "Allows to organize the information in tables. Like isolating the requirements in one page and building a SCRUM Product Backlog in another.",
      "icon_name": "table",
      "icon_prefix": "fas",
      "id": 2,
      "name": "Project spreadsheet"
    },
    {
      "description": "This diagram allows the students to understand how the app behave and helps catching missing requirements.",
      "icon_name": "mobile-alt",
      "icon_prefix": "fas",
      "id": 3,
      "name": "User flow diagram"
    },
    {
      "description": "They use Figma, a professional UI/UX tool to build an interactive mockup, to test how the web app must look and behave before coding.",
      "icon_name": "figma",
      "icon_prefix": "fab",
      "id": 4,
      "name": "Design mockup"
    },
    {
      "description": "This diagram helps the students visualize the architecture of the app, it creates a model similar to how a tourist uses a map to familiarize with a new city.",
      "icon_name": "sitemap",
      "icon_prefix": "fas",
      "id": 5,
      "name": "Component tree"
    },
    {
      "description": "Here is when they start the coding process. By now they have a clear understanding of what solution to build.",
      "icon_name": "code",
      "icon_prefix": "fas",
      "id": 6,
      "name": "Coding stage"
    },
    {
      "description": "When they publish the website on real a host and make improvements based on users feedback.",
      "icon_name": "link",
      "icon_prefix": "fas",
      "id": 7,
      "name": "Post coding stage"
    }
  ],
  "projects": [
    {
      "description": "An easy project that lays down the foundation for future projects. They get familiar with good coding practices for both React components and CSS.",
      "id": 1,
      "image_name": "portfolio",
      "name": "Portfolio"
    },
    {
      "description": "This project allows to further develop clean code practice in a multi page website. Also teaches to write complex JSON files to simulate data coming from an API.",
      "id": 2,
      "image_name": "vegan",
      "name": "Vegan restaurant"
    },
    {
      "description": "A project where they switch from a static JSON file to a real API call to obtain and present data from a server.",
      "id": 3,
      "image_name": "package",
      "name": "Package tracker"
    },
    {
      "description": "Practice Test Driven Development testing techniques on a project that every developer is familiar with, so the student focuses on learning unit testing without pressure.",
      "id": 4,
      "image_name": "todo",
      "name": "Todo list"
    },
    {
      "description": "This project combines the consumer facing site of a restaurant with the admin panel of the previous project. Students will learn to reutilize components and code from previous projects.",
      "id": 5,
      "image_name": "bbq",
      "name": "BBQ restaurant"
    },
    {
      "description": "A small yet complete, Learning Management System (LMS) platform that allows to create student accounts and add more full stack features.",
      "id": 6,
      "image_name": "lms",
      "name": "Educational platform"
    },
    {
      "description": "The final project to graduate from the program. It combines all the techniques mentioned in the Tech stack while taking into consideration the UI experience.",
      "id": 7,
      "image_name": "netflix",
      "name": "Netflix clone"
    }
  ],
  "technologies": [
    {
      "description": "The most utilized Frontend framework in the Swedish market for building web applications.",
      "icon_name": "react",
      "icon_prefix": "fab",
      "id": 1,
      "name": "React"
    },
    {
      "description": "A CSS preprocessor that allows students to better organize the visual aspects of their web applications.",
      "icon_name": "sass",
      "icon_prefix": "fab",
      "id": 2,
      "name": "SASS"
    },
    {
      "description": "Enforce strong data typing in order to build robust apps and also to better collaborate with Java or C# devs.",
      "icon_name": "microsoft",
      "icon_prefix": "fab",
      "id": 3,
      "name": "TypeScript"
    },
    {
      "description": "Deploy to cloud solutions by using the Firebase suite of tools that include databases, auth and dynamic storage.",
      "icon_name": "google",
      "icon_prefix": "fab",
      "id": 4,
      "name": "FireStore & Cloud Storage"
    },
    {
      "description": "Complete Unit testing by dividing the test into logic for the JavaScript modules and UI for React components.",
      "icon_name": "facebook-f",
      "icon_prefix": "fab",
      "id": 5,
      "name": "Jest & React Testing Library"
    }
  ]
}