[
  {
    "id": 1,
    "name": "Portfolio",
    "image_name": "portfolio",
    "description": "An easy project that lays down the foundation for future projects. They get familiar with good coding practices for both React components and CSS."
  },
  {
    "id": 2,
    "name": "Vegan restaurant",
    "image_name": "vegan",
    "description": "This project allows to further develop clean code practice in a multi page website. Also teaches to write complex JSON files to simulate data coming from an API."
  },
  {
    "id": 3,
    "name": "Package tracker",
    "image_name": "package",
    "description": "A project where they switch from a static JSON file to a real API call to obtain and present data from a server."
  },
  {
    "id": 4,
    "name": "Todo list",
    "image_name": "todo",
    "description": "Practice Test Driven Development testing techniques on a project that every developer is familiar with, so the student focuses on learning unit testing without pressure."
  },
  {
    "id": 5,
    "name": "E-Commerce",
    "image_name": "e-commerce",
    "description": "We move from building front end sites for consumers, to building an administrator panel of an e-commerce store, where the owner can add categories and products to sell."
  },
  {
    "id": 6,
    "name": "BBQ restaurant",
    "image_name": "bbq",
    "description": "This project combines the consumer facing site of a restaurant with the admin panel of the previous project. Students will learn to reutilize components and code from previous projects."
  },
  {
    "id": 7,
    "name": "Educational platform",
    "image_name": "lms",
    "description": "A small yet complete, Learning Management System (LMS) platform that allows to create student accounts and add more full stack features."
  },
  {
    "id": 8,
    "name": "Netflix clone",
    "image_name": "netflix",
    "description": "The final project to graduate from the program. It combines all the techniques mentioned in the Tech stack while taking into consideration the UI experience."
  }
]
